Revit 2024 API
BuiltInFailures.SlabShapeFailures.SlabShapeEditFailedError Property
 Slab Shape Edit failed. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SlabShapeEditFailedError { get; }
Visual Basic
Public Shared ReadOnly Property SlabShapeEditFailedError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SlabShapeEditFailedError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace